// 浮层数据
(function () {
	var layerInfo = {
		'school': {
			'type': 'school',
			'title': '小学鸡孵化区',
			'details': [
				{
					'cate': 0,
					'subtitle': '场景介绍',
					'info': '全市最吵的也是最有青春活力的地方，分布着大量能一口气跳下来整套“雏鹰起飞”不喘粗气的小学鸡'
				},
				{
					'cate': 0,
					'subtitle': '注意事项',
					'info': '除了高山般的作业和试卷，还要多提防各类黄鼠狼的入侵'
				}
			],
			'difficulty': {
				'subtitle': '难度指数',
				'value': 4
			}
		},
		'family': {
			'type': 'family',
			'title': '肥宅快乐天地',
			'details': [
				{
					'subtitle': '场景介绍',
					'info': '快乐水、空调、70寸至尊液晶电视……宅在家的乐趣，你懂我懂大家懂！！'
				},
				{
					'subtitle': '注意事项',
					'info': '欲带皇冠，必承其重。想要获得独自在家的自由，就要作为守门员守护好家中的一切。你，准备好了吗？'
				}
			],
			'difficulty': {
				'subtitle': '难度指数',
				'value': 4
			}
		},
		'subway': {
			'type': 'subway',
			'title': '早高峰大蒸笼',
			'details': [
				{
					'subtitle': '场景介绍',
					'info': '人人人人人人人人人人人人人人……'
				},
				{
					'subtitle': '注意事项',
					'info': '早高峰大蒸笼：“游泳健身了解一下”、“小朋友喜欢英语吗”、“首付只要2000万的学区房考虑下”…挤出重围难度堪比千米长跑。'
				}
			],
			'difficulty': {
				'subtitle': '难度指数',
				'value': 3
			}
		},
		'scenic': {
			'type': 'scenic',
			'title': '网红打卡圣地',
			'details': [
				{
					'subtitle': '场景介绍',
					'info': '坐你旁边的是位18线演员，前面点菜的是一位KOL，而已经摆拍了半小时的是位美食博主。这，就是网红景点。'
				},
				{
					'subtitle': '注意事项',
					'info': '在提防由于长得太可爱被抓去当合照吉祥物的同时，也要小心别处伸出的手。'
				}
			],
			'difficulty': {
				'subtitle': '难度指数',
				'value': 3
			}
		}
	};
	var questions = {
		'school': [
			{
				'ask': '放学了，爸爸给你打电话，说要晚20分钟才能来接你，你的选择是？',
				'ans': 'B',
				'list': [
					{t: 'A', v: '投向附近超市的怀抱'}, 
					{t: 'B', v: '坐在学校保安亭里做作业'}, 
					{t: 'C', v: '抵挡不住回家的诱惑，自己走'}
				]
			},
			{
				'ask': '出现了一个年迈的老爷爷让你帮忙带路去附近的轻轨站，你会怎么做？',
				'ans': 'A',
				'list': [
					{t: 'A', v: '可以指路，但坚决不带路'}, 
					{t: 'B', v: '果断带路，我助人为乐！'}, 
					{t: 'C', v: '给他指路，如果还不太清楚的话就带他去'}
				]
			},
			{
				'ask': '独自走在回家的路上，感觉后面有人在尾随你，该怎么办？',
				'ans': 'C',
				'list': [
					{t: 'A', v: '向周围人大声呼喊，并迅速走开'},
					{t: 'B', v: '硬碰硬，和他拼了！'},
					{t: 'C', v: '跑进路边警察局'}
				]
			}
		],
		'family': [
			{
				'ask': '爸妈加班的周末，你独自在家，这时，响起了敲门声，对方说是你家邻居想要借洗手间用一下，这时你决定：',
				'ans': 'A',
				'list': [
					{t: 'A', v: '不开不开我不开，妈妈没回来'},
					{t: 'B', v: '开门，并向他收取过路费'}
				]
			},
			{
				'ask': '某天夜晚，为了家庭奋斗的你爸妈又留你自己在家，窗外的雨像书桓离开依萍那天一样大，突然房间停电了，你打算：',
				'ans': 'C',
				'list': [
					{t: 'A', v: '开门一探究竟'}, 
					{t: 'B', v: '独自点蜡照明'}, 
					{t: 'C', v: '打给爸妈求助'}
				]
			},
			{
				'ask': '放学回到家，发现家里遭窃了怎么办？',
				'ans': 'A',
				'list': [
					{t: 'A', v: '迅速撤离，并打电话报警'}, 
					{t: 'B', v: '大喊大叫，让小偷滚出来'}, 
					{t: 'C', v: '若无其事，回房间做作业'}
				]
			}
		],
		'subway': [
			{
				'ask': '和妈妈一起出门坐地铁，在妈妈买票的时候，突然出现了一位阿姨不停地夸你可爱并递给你一瓶饮料，你想了想：',
				'ans': 'B',
				'list': [
					{t: 'A', v: '趁妈妈没发现快喝掉'}, 
					{t: 'B', v: '礼貌拒绝并跟紧妈妈'}
				]
			},
			{
				'ask': '地铁上，座位不够于是你和妈妈分开坐了，你感觉有些困，所以你：',
				'ans': 'B',
				'list': [
					{t: 'A', v: '很快睡着了'}, 
					{t: 'B', v: '坚持没有睡'}
				]
			},
			{
				'ask': '出站的时候，不小心和妈妈走散了，身无分文的你下定决心：',
				'ans': 'B',
				'list': [
					{t: 'A', v: '在地铁站摆摊卖艺自谋生路'}, 
					{t: 'B', v: '向工作人员寻求帮助'}
				]
			}
		],
		'scenic': [
			{
				'ask': '和姐姐一起逛景点，你看到了一家卖玩具的小店，老板邀请你去他家玩耍并承诺送你“小猪配不齐”图案的系列魔方，你看了看一旁已经精心p了一个小时图的姐姐，决定：',
				'ans': 'B',
				'list': [
					{t: 'A', v: '前往并打算多拿几个'}, 
					{t: 'B', v: '拒绝并吐槽图案太丑'}
				]
			},
			{
				'ask': '姐姐去试服装了，让你在沙发上等她，这时出现了一位阿姨和你说你爸爸出意外了，让你赶快和她一起去医院，这时你：',
				'ans': 'B',
				'list': [
					{t: 'A', v: '此时不去待何时！'}, 
					{t: 'B', v: '极度怀疑，并给爸爸打电话确认'}
				]
			},
			{
				'ask': '逛街时，拥挤的人流把你挤得看不到姐姐在哪里，这时，一双手伸了过来把你用力拽走了，你发现并不是姐姐，你决定：',
				'ans': 'A',
				'list': [
					{t: 'A', v: '大声呼救，引起注意'}, 
					{t: 'B', v: '极度恐惧，小声啜泣'}
				]
			}
		]
	};
	var grade = {
		'school': [
			{ 'label': '未出壳的小学鸡', 'desc': '你还需多加修炼，争取早日破壳而出！' },
			{ 'label': '傻白甜校花', 'desc': '世道险恶，还需提高警惕！' },
			{ 'label': '小学鸡大哥大', 'desc': '你离巅峰只差一步之遥！' },
			{ 'label': '教导主任', 'desc': '还等啥呢，快去和小伙伴分享你的防拐技巧！' }
		],
		'family': [
			{ 'label': '入门级守门员', 'desc': '别睡了，对方已经进了10个球了' },
			{ 'label': '初级守门员', 'desc': '我已经看到了你的潜力！' },
			{ 'label': '银牌守门员', 'desc': '再加把劲，你就是明日冠军！' },
			{ 'label': '金牌守门员', 'desc': '恭喜你成功守住家门！' }
		],
		'subway': [
			{ 'label': '初级安保员', 'desc': '初出茅庐，注意多学习多观察！' },
			{ 'label': '中级安保员', 'desc': '多多努力，晋升空间还很大' },
			{ 'label': '安保队长', 'desc': '哟吼？已经渐入佳境！' },
			{ 'label': '安保大师', 'desc': '恭喜你！通过了最高安保级别的考验！' }
		],
		'scenic': [
			{ 'label': '防拐一级学者', 'desc': '现在！立刻！马上！去搜索“防拐知识”并熟读背诵！' },
			{ 'label': '防拐四级学者', 'desc': '警惕心还需提高，别给坏人可乘之机！' },
			{ 'label': '防拐六级学者', 'desc': '你已经几乎可以看破坏人的所有伎俩了！' },
			{ 'label': '防拐十级学者', 'desc': '这条街最机智的仔就是你！' }
		]
	};
	window.CHILD_CONFIG = {
		basic: layerInfo,
		questions: questions,
		grade: grade
	};
})();